STMicroelectronics/x-cube-azrtos-wl/Drivers/CMSIS/Device/ST/STM32WLxx/Include/stm32WLxxxxx.h
/********************  Bits definition for EXTI_C2IMR2 register  **************/
#define EXTI_C2IMR2_IM34_Pos     (2U)
#define EXTI_C2IMR2_IM34_Msk     (0x1UL << EXTI_C2IMR2_IM34_Pos)               /*!< 0x00000004 */
#define EXTI_C2IMR2_IM34         EXTI_C2IMR2_IM34_Msk                          /*!< CPU2 Interrupt Mask on line 34 */
#define EXTI_C2IMR2_IM36_Pos     (4U)
#define EXTI_C2IMR2_IM36_Msk     (0x1UL << EXTI_C2IMR2_IM36_Pos)               /*!< 0x00000010 */
#define EXTI_C2IMR2_IM36         EXTI_C2IMR2_IM36_Msk                          /*!< CPU2 Interrupt Mask on line 36 */
#define EXTI_C2IMR2_IM37_Pos     (5U)
#define EXTI_C2IMR2_IM37_Msk     (0x1UL << EXTI_C2IMR2_IM37_Pos)               /*!< 0x00000020 */
#define EXTI_C2IMR2_IM37         EXTI_C2IMR2_IM37_Msk                          /*!< CPU2 Interrupt Mask on line 37 */
#define EXTI_C2IMR2_IM38_Pos     (6U)
#define EXTI_C2IMR2_IM38_Msk     (0x1UL << EXTI_C2IMR2_IM38_Pos)               /*!< 0x00000040 */
#define EXTI_C2IMR2_IM38         EXTI_C2IMR2_IM38_Msk                          /*!< CPU2 Interrupt Mask on line 38 */
#define EXTI_C2IMR2_IM39_Pos     (7U)
#define EXTI_C2IMR2_IM39_Msk     (0x1UL << EXTI_C2IMR2_IM39_Pos)               /*!< 0x00000080 */
#define EXTI_C2IMR2_IM39         EXTI_C2IMR2_IM39_Msk                          /*!< CPU2 Interrupt Mask on line 39 */
#define EXTI_C2IMR2_IM40_Pos     (8U)
#define EXTI_C2IMR2_IM40_Msk     (0x1UL << EXTI_C2IMR2_IM40_Pos)               /*!< 0x00000100 */
#define EXTI_C2IMR2_IM40         EXTI_C2IMR2_IM40_Msk                          /*!< CPU2 Interrupt Mask on line 40 */
#define EXTI_C2IMR2_IM41_Pos     (9U)
#define EXTI_C2IMR2_IM41_Msk     (0x1UL << EXTI_C2IMR2_IM41_Pos)               /*!< 0x00000200 */
#define EXTI_C2IMR2_IM41         EXTI_C2IMR2_IM41_Msk                          /*!< CPU2 Interrupt Mask on line 41 */
#define EXTI_C2IMR2_IM42_Pos     (10U)
#define EXTI_C2IMR2_IM42_Msk     (0x1UL << EXTI_C2IMR2_IM42_Pos)               /*!< 0x00000400 */
#define EXTI_C2IMR2_IM42         EXTI_C2IMR2_IM42_Msk                          /*!< CPU2 Interrupt Mask on line 42 */
#define EXTI_C2IMR2_IM43_Pos     (11U)
#define EXTI_C2IMR2_IM43_Msk     (0x1UL << EXTI_C2IMR2_IM43_Pos)               /*!< 0x00000800 */
#define EXTI_C2IMR2_IM43         EXTI_C2IMR2_IM43_Msk                          /*!< CPU2 Interrupt Mask on line 43 */
#define EXTI_C2IMR2_IM44_Pos     (12U)
#define EXTI_C2IMR2_IM44_Msk     (0x1UL << EXTI_C2IMR2_IM44_Pos)               /*!< 0x00001000 */
#define EXTI_C2IMR2_IM44         EXTI_C2IMR2_IM44_Msk                          /*!< CPU2 Interrupt Mask on line 44 */
#define EXTI_C2IMR2_IM45_Pos     (13U)
#define EXTI_C2IMR2_IM45_Msk     (0x1UL << EXTI_C2IMR2_IM45_Pos)               /*!< 0x00002000 */
#define EXTI_C2IMR2_IM45         EXTI_C2IMR2_IM45_Msk                          /*!< CPU2 Interrupt Mask on line 45 */
#define EXTI_C2IMR2_IM46_Pos     (14U)
#define EXTI_C2IMR2_IM46_Msk     (0x1UL << EXTI_C2IMR2_IM46_Pos)               /*!< 0x00004000 */
#define EXTI_C2IMR2_IM46         EXTI_C2IMR2_IM46_Msk                          /*!< CPU2 Interrupt Mask on line 46 */

/********************  Bits definition for EXTI_C2EMR2 register  **************/
#define EXTI_C2EMR2_EM40_Pos     (8U)
#define EXTI_C2EMR2_EM40_Msk     (0x1UL << EXTI_C2EMR2_EM40_Pos)               /*!< 0x00000100 */
#define EXTI_C2EMR2_EM40         EXTI_C2EMR2_EM40_Msk                          /*!< CPU2 Event Mask on line 40 */
#define EXTI_C2EMR2_EM41_Pos     (9U)
#define EXTI_C2EMR2_EM41_Msk     (0x1UL << EXTI_C2EMR2_EM41_Pos)               /*!< 0x00000200 */
#define EXTI_C2EMR2_EM41         EXTI_C2EMR2_EM41_Msk                          /*!< CPU2 Event Mask on line 41 */

#endif
#if defined(STM32WL55xx) || defined(STM32WL54xx) 
/******************************************************************************/
/*                                                                            */
/*                        Global Security Control                            */
/*                                                                            */
/******************************************************************************/
/*******************  Bits definition for registers x = 0  ********************/
#define GTZC_CFGR1_TZIC_Pos                 (0U)
#define GTZC_CFGR1_TZIC_Msk                 (0x01UL << GTZC_CFGR1_TZIC_Pos)     /*!< 0x00000001 */
#define GTZC_CFGR1_TZSC_Pos                 (1U)
#define GTZC_CFGR1_TZSC_Msk                 (0x01UL << GTZC_CFGR1_TZSC_Pos)     /*!< 0x00000002 */
#define GTZC_CFGR1_AES_Pos                  (2U)
#define GTZC_CFGR1_AES_Msk                  (0x01UL << GTZC_CFGR1_AES_Pos)      /*!< 0x00000004 */
#define GTZC_CFGR1_RNG_Pos                  (3U)
#define GTZC_CFGR1_RNG_Msk                  (0x01UL << GTZC_CFGR1_RNG_Pos)      /*!< 0x00000008 */
#define GTZC_CFGR1_SUBGHZSPI_Pos            (4U)
#define GTZC_CFGR1_SUBGHZSPI_Msk            (0x01UL << GTZC_CFGR1_SUBGHZSPI_Pos)/*!< 0x00000010 */
#define GTZC_CFGR1_PWR_Pos                  (5U)
#define GTZC_CFGR1_PWR_Msk                  (0x01UL << GTZC_CFGR1_PWR_Pos)      /*!< 0x00000020 */
#define GTZC_CFGR1_FLASHIF_Pos              (6U)
#define GTZC_CFGR1_FLASHIF_Msk              (0x01UL << GTZC_CFGR1_FLASHIF_Pos)  /*!< 0x00000040 */
#define GTZC_CFGR1_DMA1_Pos                 (7U)
#define GTZC_CFGR1_DMA1_Msk                 (0x01UL << GTZC_CFGR1_DMA1_Pos)     /*!< 0x00000080 */
#define GTZC_CFGR1_DMA2_Pos                 (8U)
#define GTZC_CFGR1_DMA2_Msk                 (0x01UL << GTZC_CFGR1_DMA2_Pos)     /*!< 0x00000100 */
#define GTZC_CFGR1_DMAMUX_Pos               (9U)
#define GTZC_CFGR1_DMAMUX_Msk               (0x01UL << GTZC_CFGR1_DMAMUX_Pos)   /*!< 0x00000200 */
#define GTZC_CFGR1_FLASH_Pos                (10U)
#define GTZC_CFGR1_FLASH_Msk                (0x01UL << GTZC_CFGR1_FLASH_Pos)    /*!< 0x00000400 */
#define GTZC_CFGR1_SRAM1_Pos                (11U)
#define GTZC_CFGR1_SRAM1_Msk                (0x01UL << GTZC_CFGR1_SRAM1_Pos)    /*!< 0x00000800 */
#define GTZC_CFGR1_SRAM2_Pos                (12U)
#define GTZC_CFGR1_SRAM2_Msk                (0x01UL << GTZC_CFGR1_SRAM2_Pos)    /*!< 0x00001000 */
#define GTZC_CFGR1_PKA_Pos                  (13U)
#define GTZC_CFGR1_PKA_Msk                  (0x01UL << GTZC_CFGR1_PKA_Pos)      /*!< 0x00002000 */

/*******************  Bits definition for TZSC_CR register  *******************/
#define TZSC_CR_LCK_Pos                     (0U)
#define TZSC_CR_LCK_Msk                     (0x01UL << TZSC_CR_LCK_Pos)         /*!< 0x00000001 */

/*******************  Bits definition for TZSC_SECCFGR1 register  *************/
#define TZSC_SECCFGR1_ALL_Pos               (0U)
#define TZSC_SECCFGR1_ALL_Msk               (0x0000200CU)                       /*!< 0x0000200C */
#define TZSC_SECCFGR1_AESSEC_Pos            GTZC_CFGR1_AES_Pos                  /*!< AES Secure enable */
#define TZSC_SECCFGR1_AESSEC_Msk            GTZC_CFGR1_AES_Msk                  /*!< 0x00000001 */
#define TZSC_SECCFGR1_RNGSEC_Pos            GTZC_CFGR1_RNG_Pos                  /*!< RNG Secure enable */
#define TZSC_SECCFGR1_RNGSEC_Msk            GTZC_CFGR1_RNG_Msk                  /*!< 0x00000002 */
#define TZSC_SECCFGR1_PKASEC_Pos            GTZC_CFGR1_PKA_Pos                  /*!< PKA Secure enable */
#define TZSC_SECCFGR1_PKASEC_Msk            GTZC_CFGR1_PKA_Msk                  /*!< 0x00000008 */

/*******************  Bits definition for TZSC_PRIVCFGR1 register  ************/
#define TZSC_PRIVCFGR1_ALL_Pos              (0U)
#define TZSC_PRIVCFGR1_ALL_Msk              (0x0000201CU)                       /*!< 0x0000201C */
#define TZSC_PRIVCFGR1_AESPRIV_Pos          GTZC_CFGR1_AES_Pos                  /*!< AES Privileged enable */
#define TZSC_PRIVCFGR1_AESPRIV_Msk          GTZC_CFGR1_AES_Msk                  /*!< 0x00000001 */
#define TZSC_PRIVCFGR1_RNGPRIV_Pos          GTZC_CFGR1_RNG_Pos                  /*!< RNG Privileged enable */
#define TZSC_PRIVCFGR1_RNGPRIV_Msk          GTZC_CFGR1_RNG_Msk                  /*!< 0x00000002 */
#define TZSC_PRIVCFGR1_SUBGHZSPIPRIV_Pos    GTZC_CFGR1_SUBGHZSPI_Pos            /*!< SUBGHZSPI Privileged enable */
#define TZSC_PRIVCFGR1_SUBGHZSPIPRIV_Msk    GTZC_CFGR1_SUBGHZSPI_Msk            /*!< 0x00000004 */
#define TZSC_PRIVCFGR1_PKAPRIV_Pos          GTZC_CFGR1_PKA_Pos                  /*!< PKA Privileged enable */
#define TZSC_PRIVCFGR1_PKAPRIV_Msk          GTZC_CFGR1_PKA_Msk                  /*!< 0x00000008 */

/*******************  Bits definition for TZSC_MPCWM1_UPWMR register  *********/
#define TZSC_MPCWM1_UPWMR_LGTH_Pos          (16U)                                     /*!< User Flash Unprivileged area */
#define TZSC_MPCWM1_UPWMR_LGTH_Msk          (0x0FFFUL << TZSC_MPCWM1_UPWMR_LGTH_Pos)  /*!< 0x0FFF0000 */

/*******************  Bits definition for TZSC_MPCWM1_UPWWMR register  ********/
#define TZSC_MPCWM1_UPWWMR_LGTH_Pos         (16U)                                     /*!< User Flash Flash Unprivileged Writable area */
#define TZSC_MPCWM1_UPWWMR_LGTH_Msk         (0x0FFFUL << TZSC_MPCWM1_UPWWMR_LGTH_Pos) /*!< 0x0FFF0000 */

/*******************  Bits definition for TZSC_MPCWM2_UPWMR register  *********/
#define TZSC_MPCWM2_UPWMR_LGTH_Pos          (16U)                                     /*!< User SRAM1 Unprivileged area */
#define TZSC_MPCWM2_UPWMR_LGTH_Msk          (0x0FFFUL << TZSC_MPCWM2_UPWMR_LGTH_Pos)  /*!< 0x0FFF0000 */

