STMicroelectronics/x-cube-azrtos-wl/Drivers/CMSIS/Device/ST/STM32WLxx/Include/stm32WLxxxxx.h
/*******************  Bits definition for TZSC_MPCWM3_UPWMR register  *********/
#define TZSC_MPCWM3_UPWMR_LGTH_Pos          (16U)                                     /*!< User Flash Unprivileged area */
#define TZSC_MPCWM3_UPWMR_LGTH_Msk          (0x0FFFUL << TZSC_MPCWM3_UPWMR_LGTH_Pos)  /*!< 0x0FFF0000 */


/*******************  Bits definition for TZIC_IMR0 register  *****************/
#define TZIC_IER1_ALL_Msk                   0x00003FFFu
#define TZIC_IER1_TZICIE_Pos                GTZC_CFGR1_TZIC_Pos
#define TZIC_IER1_TZICIE_Msk                GTZC_CFGR1_TZIC_Msk                  /*!< 0x00000001 */
#define TZIC_IER1_TZSCIE_Pos                GTZC_CFGR1_TZSC_Pos
#define TZIC_IER1_TZSCIE_Msk                GTZC_CFGR1_TZSC_Msk                  /*!< 0x00000002 */
#define TZIC_IER1_AESIE_Pos                 GTZC_CFGR1_AES_Pos
#define TZIC_IER1_AESIE_Msk                 GTZC_CFGR1_AES_Msk                   /*!< 0x00000004 */
#define TZIC_IER1_RNGIE_Pos                 GTZC_CFGR1_RNG_Pos
#define TZIC_IER1_RNGIE_Msk                 GTZC_CFGR1_RNG_Msk                   /*!< 0x00000008 */
#define TZIC_IER1_SUBGHZSPIIE_Pos           GTZC_CFGR1_SUBGHZSPI_Pos
#define TZIC_IER1_SUBGHZSPIIE_Msk           GTZC_CFGR1_SUBGHZSPI_Msk             /*!< 0x00000010 */
#define TZIC_IER1_PWRIE_Pos                 GTZC_CFGR1_PWR_Pos
#define TZIC_IER1_PWRIE_Msk                 GTZC_CFGR1_PWR_Msk                   /*!< 0x00000020 */
#define TZIC_IER1_FLASHIFIE_Pos             GTZC_CFGR1_FLASHIF_Pos
#define TZIC_IER1_FLASHIFIE_Msk             GTZC_CFGR1_FLASHIF_Msk               /*!< 0x00000040 */
#define TZIC_IER1_DMA1IE_Pos                GTZC_CFGR1_DMA1_Pos
#define TZIC_IER1_DMA1IE_Msk                GTZC_CFGR1_DMA1_Msk                  /*!< 0x00000080 */
#define TZIC_IER1_DMA2IE_Pos                GTZC_CFGR1_DMA2_Pos
#define TZIC_IER1_DMA2IE_Msk                GTZC_CFGR1_DMA2_Msk                  /*!< 0x00000100 */
#define TZIC_IER1_DMAMUXIE_Pos              GTZC_CFGR1_DMAMUX_Pos
#define TZIC_IER1_DMAMUXIE_Msk              GTZC_CFGR1_DMAMUX_Msk                /*!< 0x00000200 */
#define TZIC_IER1_FLASHIE_Pos               GTZC_CFGR1_FLASH_Pos
#define TZIC_IER1_FLASHIE_Msk               GTZC_CFGR1_FLASH_Msk                 /*!< 0x00000400 */
#define TZIC_IER1_SRAM1IE_Pos               GTZC_CFGR1_SRAM1_Pos
#define TZIC_IER1_SRAM1IE_Msk               GTZC_CFGR1_SRAM1_Msk                 /*!< 0x00000800 */
#define TZIC_IER1_SRAM2IE_Pos               GTZC_CFGR1_SRAM2_Pos
#define TZIC_IER1_SRAM2IE_Msk               GTZC_CFGR1_SRAM2_Msk                 /*!< 0x00001000 */
#define TZIC_IER1_PKAIE_Pos                 GTZC_CFGR1_PKA_Pos
#define TZIC_IER1_PKAIE_Msk                 GTZC_CFGR1_PKA_Msk                   /*!< 0x00002000 */

/*******************  Bits definition for TZIC_MISR1 register  ****************/
#define TZIC_MISR1_TZICMF_Pos               GTZC_CFGR1_TZIC_Pos
#define TZIC_MISR1_TZICMF_Msk               GTZC_CFGR1_TZIC_Msk                  /*!< 0x00000001 */
#define TZIC_MISR1_TZSCMF_Pos               GTZC_CFGR1_TZSC_Pos
#define TZIC_MISR1_TZSCMF_Msk               GTZC_CFGR1_TZSC_Msk                  /*!< 0x00000002 */
#define TZIC_MISR1_AESMF_Pos                GTZC_CFGR1_AES_Pos
#define TZIC_MISR1_AESMF_Msk                GTZC_CFGR1_AES_Msk                   /*!< 0x00000004 */
#define TZIC_MISR1_RNGMF_Pos                GTZC_CFGR1_RNG_Pos
#define TZIC_MISR1_RNGMF_Msk                GTZC_CFGR1_RNG_Msk                   /*!< 0x00000008 */
#define TZIC_MISR1_SUBGHZSPIMF_Pos          GTZC_CFGR1_SUBGHZSPI_Pos
#define TZIC_MISR1_SUBGHZSPIMF_Msk          GTZC_CFGR1_SUBGHZSPI_Msk             /*!< 0x00000010 */
#define TZIC_MISR1_PWRMF_Pos                GTZC_CFGR1_PWR_Pos
#define TZIC_MISR1_PWRMF_Msk                GTZC_CFGR1_PWR_Msk                   /*!< 0x00000020 */
#define TZIC_MISR1_FLASHIFMF_Pos            GTZC_CFGR1_FLASHIF_Pos
#define TZIC_MISR1_FLASHIFMF_Msk            GTZC_CFGR1_FLASHIF_Msk               /*!< 0x00000040 */
#define TZIC_MISR1_DMA1MF_Pos               GTZC_CFGR1_DMA1_Pos
#define TZIC_MISR1_DMA1MF_Msk               GTZC_CFGR1_DMA1_Msk                  /*!< 0x00000080 */
#define TZIC_MISR1_DMA2MF_Pos               GTZC_CFGR1_DMA2_Pos
#define TZIC_MISR1_DMA2MF_Msk               GTZC_CFGR1_DMA2_Msk                  /*!< 0x00000100 */
#define TZIC_MISR1_DMAMUXMF_Pos             GTZC_CFGR1_DMAMUX_Pos
#define TZIC_MISR1_DMAMUXMF_Msk             GTZC_CFGR1_DMAMUX_Msk                /*!< 0x00000200 */
#define TZIC_MISR1_FLASHMF_Pos              GTZC_CFGR1_FLASH_Pos
#define TZIC_MISR1_FLASHMF_Msk              GTZC_CFGR1_FLASH_Msk                 /*!< 0x00000400 */
#define TZIC_MISR1_SRAM1MF_Pos              GTZC_CFGR1_SRAM1_Pos
#define TZIC_MISR1_SRAM1MF_Msk              GTZC_CFGR1_SRAM1_Msk                 /*!< 0x00000800 */
#define TZIC_MISR1_SRAM2MF_Pos              GTZC_CFGR1_SRAM2_Pos
#define TZIC_MISR1_SRAM2MF_Msk              GTZC_CFGR1_SRAM2_Msk                 /*!< 0x00001000 */
#define TZIC_MISR1_PKAMF_Pos                GTZC_CFGR1_PKA_Pos
#define TZIC_MISR1_PKAMF_Msk                GTZC_CFGR1_PKA_Msk                   /*!< 0x00002000 */

/*******************  Bits definition for TZIC_IFCR0 register  ****************/
#define TZIC_ICR1_TZICCF_Pos                GTZC_CFGR1_TZIC_Pos
#define TZIC_ICR1_TZICCF_Msk                GTZC_CFGR1_TZIC_Msk                  /*!< 0x00000001 */
#define TZIC_ICR1_TZSCCF_Pos                GTZC_CFGR1_TZSC_Pos
#define TZIC_ICR1_TZSCCF_Msk                GTZC_CFGR1_TZSC_Msk                  /*!< 0x00000002 */
#define TZIC_ICR1_AESCF_Pos                 GTZC_CFGR1_AES_Pos
#define TZIC_ICR1_AESCF_Msk                 GTZC_CFGR1_AES_Msk                   /*!< 0x00000004 */
#define TZIC_ICR1_RNGCF_Pos                 GTZC_CFGR1_RNG_Pos
#define TZIC_ICR1_RNGCF_Msk                 GTZC_CFGR1_RNG_Msk                   /*!< 0x00000008 */
#define TZIC_ICR1_SUBGHZSPICF_Pos           GTZC_CFGR1_SUBGHZSPI_Pos
#define TZIC_ICR1_SUBGHZSPICF_Msk           GTZC_CFGR1_SUBGHZSPI_Msk             /*!< 0x00000010 */
#define TZIC_ICR1_PWRCF_Pos                 GTZC_CFGR1_PWR_Pos
#define TZIC_ICR1_PWRCF_Msk                 GTZC_CFGR1_PWR_Msk                   /*!< 0x00000020 */
#define TZIC_ICR1_FLASHIFCF_Pos             GTZC_CFGR1_FLASHIF_Pos
#define TZIC_ICR1_FLASHIFCF_Msk             GTZC_CFGR1_FLASHIF_Msk               /*!< 0x00000040 */
#define TZIC_ICR1_DMA1CF_Pos                GTZC_CFGR1_DMA1_Pos
#define TZIC_ICR1_DMA1CF_Msk                GTZC_CFGR1_DMA1_Msk                  /*!< 0x00000080 */
#define TZIC_ICR1_DMA2CF_Pos                GTZC_CFGR1_DMA2_Pos
#define TZIC_ICR1_DMA2CF_Msk                GTZC_CFGR1_DMA2_Msk                  /*!< 0x00000100 */
#define TZIC_ICR1_DMAMUXCF_Pos              GTZC_CFGR1_DMAMUX_Pos
#define TZIC_ICR1_DMAMUXCF_Msk              GTZC_CFGR1_DMAMUX_Msk                /*!< 0x00000200 */
#define TZIC_ICR1_FLASHCF_Pos               GTZC_CFGR1_FLASH_Pos
#define TZIC_ICR1_FLASHCF_Msk               GTZC_CFGR1_FLASH_Msk                 /*!< 0x00000400 */
#define TZIC_ICR1_SRAM1CF_Pos               GTZC_CFGR1_SRAM1_Pos
#define TZIC_ICR1_SRAM1CF_Msk               GTZC_CFGR1_SRAM1_Msk                 /*!< 0x00000800 */
#define TZIC_ICR1_SRAM2CF_Pos               GTZC_CFGR1_SRAM2_Pos
#define TZIC_ICR1_SRAM2CF_Msk               GTZC_CFGR1_SRAM2_Msk                 /*!< 0x00001000 */
#define TZIC_ICR1_PKACF_Pos                 GTZC_CFGR1_PKA_Pos
#define TZIC_ICR1_PKACF_Msk                 GTZC_CFGR1_PKA_Msk                   /*!< 0x00002000 */

#endif
/******************************************************************************/
/*                                                                            */
/*                                    FLASH                                   */
/*                                                                            */
/******************************************************************************/
/*******************  Bits definition for FLASH_ACR register  *****************/
#define FLASH_ACR_LATENCY_Pos               (0U)
#define FLASH_ACR_LATENCY_Msk               (0x7UL << FLASH_ACR_LATENCY_Pos)   /*!< 0x00000007 */
#define FLASH_ACR_LATENCY                   FLASH_ACR_LATENCY_Msk              /*!< Latency                                             */
#define FLASH_ACR_LATENCY_0                 (0x1UL << FLASH_ACR_LATENCY_Pos)   /*!< 0x00000001 */
#define FLASH_ACR_LATENCY_1                 (0x2UL << FLASH_ACR_LATENCY_Pos)   /*!< 0x00000002 */
#define FLASH_ACR_PRFTEN_Pos                (8U)
#define FLASH_ACR_PRFTEN_Msk                (0x1UL << FLASH_ACR_PRFTEN_Pos)    /*!< 0x00000100 */
#define FLASH_ACR_PRFTEN                    FLASH_ACR_PRFTEN_Msk               /*!< Prefetch enable                                     */
#define FLASH_ACR_ICEN_Pos                  (9U)
#define FLASH_ACR_ICEN_Msk                  (0x1UL << FLASH_ACR_ICEN_Pos)      /*!< 0x00000200 */
#define FLASH_ACR_ICEN                      FLASH_ACR_ICEN_Msk                 /*!< Instruction cache enable                            */
#define FLASH_ACR_DCEN_Pos                  (10U)
#define FLASH_ACR_DCEN_Msk                  (0x1UL << FLASH_ACR_DCEN_Pos)      /*!< 0x00000400 */
#define FLASH_ACR_DCEN                      FLASH_ACR_DCEN_Msk                 /*!< Data cache enable                                   */
#define FLASH_ACR_ICRST_Pos                 (11U)
#define FLASH_ACR_ICRST_Msk                 (0x1UL << FLASH_ACR_ICRST_Pos)     /*!< 0x00000800 */
#define FLASH_ACR_ICRST                     FLASH_ACR_ICRST_Msk                /*!< Instruction cache reset                             */
#define FLASH_ACR_DCRST_Pos                 (12U)
#define FLASH_ACR_DCRST_Msk                 (0x1UL << FLASH_ACR_DCRST_Pos)     /*!< 0x00001000 */
#define FLASH_ACR_DCRST                     FLASH_ACR_DCRST_Msk                /*!< Data cache reset                                    */
#define FLASH_ACR_PES_Pos                   (15U)
#define FLASH_ACR_PES_Msk                   (0x1UL << FLASH_ACR_PES_Pos)       /*!< 0x00008000 */
#define FLASH_ACR_PES                       FLASH_ACR_PES_Msk                  /*!< Program/erase suspend request                       */
#define FLASH_ACR_EMPTY_Pos                 (16U)
#define FLASH_ACR_EMPTY_Msk                 (0x1UL << FLASH_ACR_EMPTY_Pos)     /*!< 0x00010000 */
#define FLASH_ACR_EMPTY                     FLASH_ACR_EMPTY_Msk                /*!< Flash use area empty                                */

#if defined(STM32WL55xx) || defined(STM32WL54xx) 
/*******************  Bits definition for FLASH_ACR2 register  ****************/
#define FLASH_ACR2_PRIVMODE_Pos             (0U)
#define FLASH_ACR2_PRIVMODE_Msk             (0x1UL << FLASH_ACR2_PRIVMODE_Pos) /*!< 0x00000001 */
#define FLASH_ACR2_PRIVMODE                 FLASH_ACR2_PRIVMODE_Msk            /*!< CFI privileged mode                                 */
#define FLASH_ACR2_HDPADIS_Pos              (1U)
#define FLASH_ACR2_HDPADIS_Msk              (0x1UL << FLASH_ACR2_HDPADIS_Pos)    /*!< 0x00000002 */
#define FLASH_ACR2_HDPADIS                  FLASH_ACR2_HDPADIS_Msk               /*!< Flash User Hide Protection area access disable    */
#define FLASH_ACR2_C2SWDBGEN_Pos            (2U)
#define FLASH_ACR2_C2SWDBGEN_Msk            (0x1UL << FLASH_ACR2_C2SWDBGEN_Pos)/*!< 0x00000004 */
#define FLASH_ACR2_C2SWDBGEN                FLASH_ACR2_C2SWDBGEN_Msk           /*!< CPU2 Software debug enable                          */

#endif
/*******************  Bits definition for FLASH_SR register  ******************/
#define FLASH_SR_EOP_Pos                    (0U)
#define FLASH_SR_EOP_Msk                    (0x1UL << FLASH_SR_EOP_Pos)        /*!< 0x00000001 */
#define FLASH_SR_EOP                        FLASH_SR_EOP_Msk                   /*!< End of Operation                                    */
#define FLASH_SR_OPERR_Pos                  (1U)
#define FLASH_SR_OPERR_Msk                  (0x1UL << FLASH_SR_OPERR_Pos)      /*!< 0x00000002 */
#define FLASH_SR_OPERR                      FLASH_SR_OPERR_Msk                 /*!< Operation error                                     */
#define FLASH_SR_PROGERR_Pos                (3U)
#define FLASH_SR_PROGERR_Msk                (0x1UL << FLASH_SR_PROGERR_Pos)    /*!< 0x00000008 */
#define FLASH_SR_PROGERR                    FLASH_SR_PROGERR_Msk               /*!< Programming error                                   */
#define FLASH_SR_WRPERR_Pos                 (4U)
#define FLASH_SR_WRPERR_Msk                 (0x1UL << FLASH_SR_WRPERR_Pos)     /*!< 0x00000010 */
#define FLASH_SR_WRPERR                     FLASH_SR_WRPERR_Msk                /*!< Write protection error                              */
#define FLASH_SR_PGAERR_Pos                 (5U)
#define FLASH_SR_PGAERR_Msk                 (0x1UL << FLASH_SR_PGAERR_Pos)     /*!< 0x00000020 */
#define FLASH_SR_PGAERR                     FLASH_SR_PGAERR_Msk                /*!< Programming alignment error                         */
#define FLASH_SR_SIZERR_Pos                 (6U)
#define FLASH_SR_SIZERR_Msk                 (0x1UL << FLASH_SR_SIZERR_Pos)     /*!< 0x00000040 */
#define FLASH_SR_SIZERR                     FLASH_SR_SIZERR_Msk                /*!< Size error                                          */
#define FLASH_SR_PGSERR_Pos                 (7U)
#define FLASH_SR_PGSERR_Msk                 (0x1UL << FLASH_SR_PGSERR_Pos)     /*!< 0x00000080 */
#define FLASH_SR_PGSERR                     FLASH_SR_PGSERR_Msk                /*!< Programming sequence error                          */
#define FLASH_SR_MISERR_Pos                 (8U)
#define FLASH_SR_MISERR_Msk                 (0x1UL << FLASH_SR_MISERR_Pos)     /*!< 0x00000100 */
#define FLASH_SR_MISERR                     FLASH_SR_MISERR_Msk                /*!< Fast programming data miss error                    */
#define FLASH_SR_FASTERR_Pos                (9U)
#define FLASH_SR_FASTERR_Msk                (0x1UL << FLASH_SR_FASTERR_Pos)    /*!< 0x00000200 */
#define FLASH_SR_FASTERR                    FLASH_SR_FASTERR_Msk               /*!< Fast programming error                              */
#define FLASH_SR_OPTNV_Pos                  (13U)
#define FLASH_SR_OPTNV_Msk                  (0x1UL << FLASH_SR_OPTNV_Pos)     /*!< 0x00002000 */
#define FLASH_SR_OPTNV                      FLASH_SR_OPTNV_Msk                /*!< User option OPTVAL indication                       */
#define FLASH_SR_RDERR_Pos                  (14U)
#define FLASH_SR_RDERR_Msk                  (0x1UL << FLASH_SR_RDERR_Pos)      /*!< 0x00004000 */
#define FLASH_SR_RDERR                      FLASH_SR_RDERR_Msk                 /*!< PCROP read error                                    */
#define FLASH_SR_OPTVERR_Pos                (15U)
#define FLASH_SR_OPTVERR_Msk                (0x1UL << FLASH_SR_OPTVERR_Pos)    /*!< 0x00008000 */
#define FLASH_SR_OPTVERR                    FLASH_SR_OPTVERR_Msk               /*!< Option validity error                               */
#define FLASH_SR_BSY_Pos                    (16U)
#define FLASH_SR_BSY_Msk                    (0x1UL << FLASH_SR_BSY_Pos)        /*!< 0x00010000 */
#define FLASH_SR_BSY                        FLASH_SR_BSY_Msk                   /*!< Flash Busy                                          */
#define FLASH_SR_CFGBSY_Pos                 (18U)
#define FLASH_SR_CFGBSY_Msk                 (0x1UL << FLASH_SR_CFGBSY_Pos)     /*!< 0x00040000 */
#define FLASH_SR_CFGBSY                     FLASH_SR_CFGBSY_Msk                /*!< Programming or erase configuration busy             */
#define FLASH_SR_PESD_Pos                   (19U)
#define FLASH_SR_PESD_Msk                   (0x1UL << FLASH_SR_PESD_Pos)       /*!< 0x00080000 */
#define FLASH_SR_PESD                       FLASH_SR_PESD_Msk                  /*!< Programming/erase operation suspended               */

