STMicroelectronics/x-cube-azrtos-wl/Drivers/CMSIS/Device/ST/STM32WLxx/Include/stm32WLxxxxx.h
#define RCC_BDCR_LSCOEN_Pos                 (24U)
#define RCC_BDCR_LSCOEN_Msk                 (0x1UL << RCC_BDCR_LSCOEN_Pos)     /*!< 0x01000000 */
#define RCC_BDCR_LSCOEN                     RCC_BDCR_LSCOEN_Msk
#define RCC_BDCR_LSCOSEL_Pos                (25U)
#define RCC_BDCR_LSCOSEL_Msk                (0x1UL << RCC_BDCR_LSCOSEL_Pos)    /*!< 0x02000000 */
#define RCC_BDCR_LSCOSEL                    RCC_BDCR_LSCOSEL_Msk

/********************  Bit definition for RCC_CSR register  *******************/
#define RCC_CSR_LSION_Pos                  (0U)
#define RCC_CSR_LSION_Msk                  (0x1UL << RCC_CSR_LSION_Pos)      /*!< 0x00000001 */
#define RCC_CSR_LSION                      RCC_CSR_LSION_Msk
#define RCC_CSR_LSIRDY_Pos                 (1U)
#define RCC_CSR_LSIRDY_Msk                 (0x1UL << RCC_CSR_LSIRDY_Pos)     /*!< 0x00000002 */
#define RCC_CSR_LSIRDY                     RCC_CSR_LSIRDY_Msk
#define RCC_CSR_LSIPRE_Pos                 (4U)
#define RCC_CSR_LSIPRE_Msk                 (0x1UL << RCC_CSR_LSIPRE_Pos)     /*!< 0x00000010 */
#define RCC_CSR_LSIPRE                     RCC_CSR_LSIPRE_Msk

#define RCC_CSR_MSISRANGE_Pos              (8U)
#define RCC_CSR_MSISRANGE_Msk              (0xFUL << RCC_CSR_MSISRANGE_Pos)  /*!< 0x00000F00 */
#define RCC_CSR_MSISRANGE                  RCC_CSR_MSISRANGE_Msk
#define RCC_CSR_MSISRANGE_1                (0x4UL << RCC_CSR_MSISRANGE_Pos)  /*!< 0x00000400 */
#define RCC_CSR_MSISRANGE_2                (0x5UL << RCC_CSR_MSISRANGE_Pos)  /*!< 0x00000500 */
#define RCC_CSR_MSISRANGE_4                (0x6UL << RCC_CSR_MSISRANGE_Pos)  /*!< 0x00000600 */
#define RCC_CSR_MSISRANGE_8                (0x7UL << RCC_CSR_MSISRANGE_Pos)  /*!< 0x00000700 */

#define RCC_CSR_RFRSTF_Pos                  (14U)
#define RCC_CSR_RFRSTF_Msk                  (0x1UL << RCC_CSR_RFRSTF_Pos)      /*!< 0x0004000 */
#define RCC_CSR_RFRSTF                      RCC_CSR_RFRSTF_Msk
#define RCC_CSR_RFRST_Pos                   (15U)
#define RCC_CSR_RFRST_Msk                   (0x1UL << RCC_CSR_RFRST_Pos)       /*!< 0x0008000 */
#define RCC_CSR_RFRST                       RCC_CSR_RFRST_Msk

#define RCC_CSR_RMVF_Pos                    (23U)
#define RCC_CSR_RMVF_Msk                    (0x1UL << RCC_CSR_RMVF_Pos)        /*!< 0x00800000 */
#define RCC_CSR_RMVF                        RCC_CSR_RMVF_Msk
#define RCC_CSR_RFILARSTF_Pos               (24U)
#define RCC_CSR_RFILARSTF_Msk               (0x1UL << RCC_CSR_RFILARSTF_Pos)   /*!< 0x01000000 */
#define RCC_CSR_RFILARSTF                   RCC_CSR_RFILARSTF_Msk
#define RCC_CSR_OBLRSTF_Pos                 (25U)
#define RCC_CSR_OBLRSTF_Msk                 (0x1UL << RCC_CSR_OBLRSTF_Pos)     /*!< 0x02000000 */
#define RCC_CSR_OBLRSTF                     RCC_CSR_OBLRSTF_Msk
#define RCC_CSR_PINRSTF_Pos                 (26U)
#define RCC_CSR_PINRSTF_Msk                 (0x1UL << RCC_CSR_PINRSTF_Pos)     /*!< 0x04000000 */
#define RCC_CSR_PINRSTF                     RCC_CSR_PINRSTF_Msk
#define RCC_CSR_BORRSTF_Pos                 (27U)
#define RCC_CSR_BORRSTF_Msk                 (0x1UL << RCC_CSR_BORRSTF_Pos)     /*!< 0x08000000 */
#define RCC_CSR_BORRSTF                     RCC_CSR_BORRSTF_Msk
#define RCC_CSR_SFTRSTF_Pos                 (28U)
#define RCC_CSR_SFTRSTF_Msk                 (0x1UL << RCC_CSR_SFTRSTF_Pos)     /*!< 0x10000000 */
#define RCC_CSR_SFTRSTF                     RCC_CSR_SFTRSTF_Msk
#define RCC_CSR_IWDGRSTF_Pos                (29U)
#define RCC_CSR_IWDGRSTF_Msk                (0x1UL << RCC_CSR_IWDGRSTF_Pos)    /*!< 0x20000000 */
#define RCC_CSR_IWDGRSTF                    RCC_CSR_IWDGRSTF_Msk
#define RCC_CSR_WWDGRSTF_Pos                (30U)
#define RCC_CSR_WWDGRSTF_Msk                (0x1UL << RCC_CSR_WWDGRSTF_Pos)    /*!< 0x40000000 */
#define RCC_CSR_WWDGRSTF                    RCC_CSR_WWDGRSTF_Msk
#define RCC_CSR_LPWRRSTF_Pos                (31U)
#define RCC_CSR_LPWRRSTF_Msk                (0x1UL << RCC_CSR_LPWRRSTF_Pos)    /*!< 0x80000000 */
#define RCC_CSR_LPWRRSTF                    RCC_CSR_LPWRRSTF_Msk

/********************  Bit definition for RCC_EXTCFGR register  *******************/
#define RCC_EXTCFGR_SHDHPRE_Pos             (0U)
#define RCC_EXTCFGR_SHDHPRE_Msk             (0xFUL << RCC_EXTCFGR_SHDHPRE_Pos) /*!< 0x0000000F */
#define RCC_EXTCFGR_SHDHPRE                 RCC_EXTCFGR_SHDHPRE_Msk
#define RCC_EXTCFGR_SHDHPRE_0               (0x1UL << RCC_EXTCFGR_SHDHPRE_Pos) /*!< 0x00000001 */
#define RCC_EXTCFGR_SHDHPRE_1               (0x2UL << RCC_EXTCFGR_SHDHPRE_Pos) /*!< 0x00000002 */
#define RCC_EXTCFGR_SHDHPRE_2               (0x4UL << RCC_EXTCFGR_SHDHPRE_Pos) /*!< 0x00000004 */
#define RCC_EXTCFGR_SHDHPRE_3               (0x8UL << RCC_EXTCFGR_SHDHPRE_Pos) /*!< 0x00000008 */

#if defined(STM32WL55xx) || defined(STM32WL54xx) 
#define RCC_EXTCFGR_C2HPRE_Pos              (4U)
#define RCC_EXTCFGR_C2HPRE_Msk              (0xFUL << RCC_EXTCFGR_C2HPRE_Pos)/*!< 0x000000F0 */
#define RCC_EXTCFGR_C2HPRE                  RCC_EXTCFGR_C2HPRE_Msk
#define RCC_EXTCFGR_C2HPRE_0                (0x1UL << RCC_EXTCFGR_C2HPRE_Pos)/*!< 0x00000010 */
#define RCC_EXTCFGR_C2HPRE_1                (0x2UL << RCC_EXTCFGR_C2HPRE_Pos)/*!< 0x00000020 */
#define RCC_EXTCFGR_C2HPRE_2                (0x4UL << RCC_EXTCFGR_C2HPRE_Pos)/*!< 0x00000040 */
#define RCC_EXTCFGR_C2HPRE_3                (0x8UL << RCC_EXTCFGR_C2HPRE_Pos)/*!< 0x00000080 */

#endif
#define RCC_EXTCFGR_SHDHPREF_Pos            (16U)
#define RCC_EXTCFGR_SHDHPREF_Msk            (0x1UL << RCC_EXTCFGR_SHDHPREF_Pos)/*!< 0x00010000 */
#define RCC_EXTCFGR_SHDHPREF                RCC_EXTCFGR_SHDHPREF_Msk
#if defined(STM32WL55xx) || defined(STM32WL54xx) 
#define RCC_EXTCFGR_C2HPREF_Pos             (17U)
#define RCC_EXTCFGR_C2HPREF_Msk             (0x1UL << RCC_EXTCFGR_C2HPREF_Pos)/*!< 0x00020000 */
#define RCC_EXTCFGR_C2HPREF                 RCC_EXTCFGR_C2HPREF_Msk

/********************  Bit definition for RCC_C2AHB1ENR register  ****************/
#define RCC_C2AHB1ENR_DMA1EN_Pos            (0U)
#define RCC_C2AHB1ENR_DMA1EN_Msk            (0x1UL << RCC_C2AHB1ENR_DMA1EN_Pos)/*!< 0x00000001 */
#define RCC_C2AHB1ENR_DMA1EN                RCC_C2AHB1ENR_DMA1EN_Msk
#define RCC_C2AHB1ENR_DMA2EN_Pos            (1U)
#define RCC_C2AHB1ENR_DMA2EN_Msk            (0x1UL << RCC_C2AHB1ENR_DMA2EN_Pos)/*!< 0x00000002 */
#define RCC_C2AHB1ENR_DMA2EN                RCC_C2AHB1ENR_DMA2EN_Msk
#define RCC_C2AHB1ENR_DMAMUX1EN_Pos         (2U)
#define RCC_C2AHB1ENR_DMAMUX1EN_Msk         (0x1UL << RCC_C2AHB1ENR_DMAMUX1EN_Pos)/*!< 0x00000004 */
#define RCC_C2AHB1ENR_DMAMUX1EN             RCC_C2AHB1ENR_DMAMUX1EN_Msk
#define RCC_C2AHB1ENR_CRCEN_Pos             (12U)
#define RCC_C2AHB1ENR_CRCEN_Msk             (0x1UL << RCC_C2AHB1ENR_CRCEN_Pos)/*!< 0x00001000 */
#define RCC_C2AHB1ENR_CRCEN                  RCC_C2AHB1ENR_CRCEN_Msk

