STMicroelectronics/x-cube-azrtos-wl/Drivers/CMSIS/Device/ST/STM32WLxx/Include/stm32WLxxxxx.h
/*******************  Bit definition for TIM17_OR1 register  *****************/
#define TIM17_OR1_TI1_RMP_Pos      (0U)
#define TIM17_OR1_TI1_RMP_Msk      (0x3UL << TIM17_OR1_TI1_RMP_Pos)            /*!< 0x00000003 */
#define TIM17_OR1_TI1_RMP          TIM17_OR1_TI1_RMP_Msk                       /*!<Timer 17 input 1 connection. */
#define TIM17_OR1_TI1_RMP_0        (0x1UL << TIM17_OR1_TI1_RMP_Pos)            /*!< 0x00000001 */
#define TIM17_OR1_TI1_RMP_1        (0x2UL << TIM17_OR1_TI1_RMP_Pos)            /*!< 0x00000002 */

/*******************  Bit definition for TIM1_AF1 register  *******************/
#define TIM1_AF1_BKINE_Pos        (0U)
#define TIM1_AF1_BKINE_Msk        (0x1UL << TIM1_AF1_BKINE_Pos)                /*!< 0x00000001 */
#define TIM1_AF1_BKINE            TIM1_AF1_BKINE_Msk                           /*!<BRK BKIN input enable */
#define TIM1_AF1_BKCMP1E_Pos      (1U)                                         
#define TIM1_AF1_BKCMP1E_Msk      (0x1UL << TIM1_AF1_BKCMP1E_Pos)              /*!< 0x00000002 */
#define TIM1_AF1_BKCMP1E          TIM1_AF1_BKCMP1E_Msk                         /*!<BRK COMP1 enable */
#define TIM1_AF1_BKCMP2E_Pos      (2U)                                         
#define TIM1_AF1_BKCMP2E_Msk      (0x1UL << TIM1_AF1_BKCMP2E_Pos)              /*!< 0x00000004 */
#define TIM1_AF1_BKCMP2E          TIM1_AF1_BKCMP2E_Msk                         /*!<BRK COMP2 enable */
#define TIM1_AF1_BKINP_Pos        (9U)                                         
#define TIM1_AF1_BKINP_Msk        (0x1UL << TIM1_AF1_BKINP_Pos)                /*!< 0x00000200 */
#define TIM1_AF1_BKINP            TIM1_AF1_BKINP_Msk                           /*!<BRK BKIN input polarity */
#define TIM1_AF1_BKCMP1P_Pos      (10U)                                        
#define TIM1_AF1_BKCMP1P_Msk      (0x1UL << TIM1_AF1_BKCMP1P_Pos)              /*!< 0x00000400 */
#define TIM1_AF1_BKCMP1P          TIM1_AF1_BKCMP1P_Msk                         /*!<BRK COMP1 input polarity */
#define TIM1_AF1_BKCMP2P_Pos      (11U)                                        
#define TIM1_AF1_BKCMP2P_Msk      (0x1UL << TIM1_AF1_BKCMP2P_Pos)              /*!< 0x00000800 */
#define TIM1_AF1_BKCMP2P          TIM1_AF1_BKCMP2P_Msk                         /*!<BRK COMP2 input polarity */
#define TIM1_AF1_ETRSEL_Pos       (14U)                                        
#define TIM1_AF1_ETRSEL_Msk       (0xFUL << TIM1_AF1_ETRSEL_Pos)               /*!< 0x0003C000 */
#define TIM1_AF1_ETRSEL           TIM1_AF1_ETRSEL_Msk                          /*!<ETRSEL[3:0] bits (TIM1 ETR source selection) */
#define TIM1_AF1_ETRSEL_0         (0x1UL << TIM1_AF1_ETRSEL_Pos)               /*!< 0x00004000 */
#define TIM1_AF1_ETRSEL_1         (0x2UL << TIM1_AF1_ETRSEL_Pos)               /*!< 0x00008000 */
#define TIM1_AF1_ETRSEL_2         (0x4UL << TIM1_AF1_ETRSEL_Pos)               /*!< 0x00010000 */
#define TIM1_AF1_ETRSEL_3         (0x8UL << TIM1_AF1_ETRSEL_Pos)               /*!< 0x00020000 */

/*******************  Bit definition for TIM2_AF1 register  *******************/
#define TIM2_AF1_ETRSEL_Pos       (14U)
#define TIM2_AF1_ETRSEL_Msk       (0xFUL << TIM2_AF1_ETRSEL_Pos)               /*!< 0x0003C000 */
#define TIM2_AF1_ETRSEL           (0x00003C000)                                /*!< External trigger source selection */
#define TIM2_AF1_ETRSEL_0         (0x000004000)                                /*!< Bit_0 */
#define TIM2_AF1_ETRSEL_1         (0x000008000)                                /*!< Bit_1 */
#define TIM2_AF1_ETRSEL_2         (0x000010000)                                /*!< Bit_2 */
#define TIM2_AF1_ETRSEL_3         (0x000020000)                                /*!< Bit_3 */

/*******************  Bit definition for TIM16_AF1 register  *******************/
#define TIM16_AF1_BKINE_Pos       (0U)
#define TIM16_AF1_BKINE_Msk       (0x1UL << TIM16_AF1_BKINE_Pos)               /*!< 0x00000001 */
#define TIM16_AF1_BKINE            TIM16_AF1_BKINE_Msk                         /*!<BRK BKIN input enable */
#define TIM16_AF1_BKCMP1E_Pos     (1U)
#define TIM16_AF1_BKCMP1E_Msk     (0x1UL << TIM16_AF1_BKCMP1E_Pos)             /*!< 0x00000002 */
#define TIM16_AF1_BKCMP1E         TIM16_AF1_BKCMP1E_Msk                        /*!<BRK COMP1 enable */
#define TIM16_AF1_BKCMP2E_Pos     (2U)                                         
#define TIM16_AF1_BKCMP2E_Msk     (0x1UL << TIM16_AF1_BKCMP2E_Pos)             /*!< 0x00000004 */
#define TIM16_AF1_BKCMP2E         TIM16_AF1_BKCMP2E_Msk                        /*!<BRK COMP2 enable */
#define TIM16_AF1_BKINP_Pos       (9U)                                         
#define TIM16_AF1_BKINP_Msk       (0x1UL << TIM16_AF1_BKINP_Pos)               /*!< 0x00000200 */
#define TIM16_AF1_BKINP           TIM16_AF1_BKINP_Msk                          /*!<BRK BKIN2 input polarity */
#define TIM16_AF1_BKCMP1P_Pos     (10U)                                        
#define TIM16_AF1_BKCMP1P_Msk     (0x1UL << TIM16_AF1_BKCMP1P_Pos)             /*!< 0x00000400 */
#define TIM16_AF1_BKCMP1P         TIM16_AF1_BKCMP1P_Msk                        /*!<BRK COMP1 input polarity */
#define TIM16_AF1_BKCMP2P_Pos     (11U)                                        
#define TIM16_AF1_BKCMP2P_Msk     (0x1UL << TIM16_AF1_BKCMP2P_Pos)             /*!< 0x00000800 */
#define TIM16_AF1_BKCMP2P         TIM16_AF1_BKCMP2P_Msk                        /*!<BRK COMP2 input polarity */

/*******************  Bit definition for TIM17_AF1 register  *******************/
#define TIM17_AF1_BKINE_Pos       (0U)
#define TIM17_AF1_BKINE_Msk       (0x1UL << TIM17_AF1_BKINE_Pos)               /*!< 0x00000001 */
#define TIM17_AF1_BKINE           TIM17_AF1_BKINE_Msk                          /*!<BRK BKIN input enable */
#define TIM17_AF1_BKCMP1E_Pos     (1U)
#define TIM17_AF1_BKCMP1E_Msk     (0x1UL << TIM17_AF1_BKCMP1E_Pos)             /*!< 0x00000002 */
#define TIM17_AF1_BKCMP1E         TIM17_AF1_BKCMP1E_Msk                        /*!<BRK COMP1 enable */
#define TIM17_AF1_BKCMP2E_Pos     (2U)                                         
#define TIM17_AF1_BKCMP2E_Msk     (0x1UL << TIM17_AF1_BKCMP2E_Pos)             /*!< 0x00000004 */
#define TIM17_AF1_BKCMP2E         TIM17_AF1_BKCMP2E_Msk                        /*!<BRK COMP2 enable */
#define TIM17_AF1_BKINP_Pos       (9U)                                         
#define TIM17_AF1_BKINP_Msk       (0x1UL << TIM17_AF1_BKINP_Pos)               /*!< 0x00000200 */
#define TIM17_AF1_BKINP           TIM17_AF1_BKINP_Msk                          /*!<BRK BKIN2 input polarity */
#define TIM17_AF1_BKCMP1P_Pos     (10U)                                        
#define TIM17_AF1_BKCMP1P_Msk     (0x1UL << TIM17_AF1_BKCMP1P_Pos)             /*!< 0x00000400 */
#define TIM17_AF1_BKCMP1P         TIM17_AF1_BKCMP1P_Msk                        /*!<BRK COMP1 input polarity */
#define TIM17_AF1_BKCMP2P_Pos     (11U)                                        
#define TIM17_AF1_BKCMP2P_Msk     (0x1UL << TIM17_AF1_BKCMP2P_Pos)             /*!< 0x00000800 */
#define TIM17_AF1_BKCMP2P         TIM17_AF1_BKCMP2P_Msk                        /*!<BRK COMP2 input polarity */

/*******************  Bit definition for TIM1_AF2 register  *******************/
#define TIM1_AF2_BK2INE_Pos       (0U)
#define TIM1_AF2_BK2INE_Msk       (0x1UL << TIM1_AF2_BK2INE_Pos)               /*!< 0x00000001 */
#define TIM1_AF2_BK2INE           TIM1_AF2_BK2INE_Msk                          /*!<BRK2 BKIN2 input enable */
#define TIM1_AF2_BK2CMP1E_Pos     (1U)                                         
#define TIM1_AF2_BK2CMP1E_Msk     (0x1UL << TIM1_AF2_BK2CMP1E_Pos)             /*!< 0x00000002 */
#define TIM1_AF2_BK2CMP1E         TIM1_AF2_BK2CMP1E_Msk                        /*!<BRK2 COMP1 enable */
#define TIM1_AF2_BK2CMP2E_Pos     (2U)                                         
#define TIM1_AF2_BK2CMP2E_Msk     (0x1UL << TIM1_AF2_BK2CMP2E_Pos)             /*!< 0x00000004 */
#define TIM1_AF2_BK2CMP2E         TIM1_AF2_BK2CMP2E_Msk                        /*!<BRK2 COMP2 enable */
#define TIM1_AF2_BK2INP_Pos       (9U)                                         
#define TIM1_AF2_BK2INP_Msk       (0x1UL << TIM1_AF2_BK2INP_Pos)               /*!< 0x00000200 */
#define TIM1_AF2_BK2INP           TIM1_AF2_BK2INP_Msk                          /*!<BRK2 BKIN2 input polarity */
#define TIM1_AF2_BK2CMP1P_Pos     (10U)                                        
#define TIM1_AF2_BK2CMP1P_Msk     (0x1UL << TIM1_AF2_BK2CMP1P_Pos)             /*!< 0x00000400 */
#define TIM1_AF2_BK2CMP1P         TIM1_AF2_BK2CMP1P_Msk                        /*!<BRK2 COMP1 input polarity */
#define TIM1_AF2_BK2CMP2P_Pos     (11U)                                        
#define TIM1_AF2_BK2CMP2P_Msk     (0x1UL << TIM1_AF2_BK2CMP2P_Pos)             /*!< 0x00000800 */
#define TIM1_AF2_BK2CMP2P         TIM1_AF2_BK2CMP2P_Msk                        /*!<BRK2 COMP2 input polarity */


/** @addtogroup Exported_macros
  * @{
  */

#if defined(STM32WL55xx) || defined(STM32WL54xx)
/*!< Root Secure Service Library */
/*!< HDP Area constant definition */
#define RSSLIB_HDP_AREA_Pos       (0U)
#define RSSLIB_HDP_AREA_Msk       (0x3UL << RSSLIB_HDP_AREA_Pos)
#define RSSLIB_HDP_AREA1_Msk      (0x1UL << RSSLIB_HDP_AREA_Pos)
#define RSSLIB_HDP_AREA1          RSSLIB_HDP_AREA1_Msk

/**
  * @brief  Prototype of RSSLIB Close and exit HDP Function
  * @detail This function close the requested hdp area passed in input
  *         parameter and jump to the reset handler present within the
  *         Vector table. The function does not return on successful execution.
  * @param  HdpArea notifies which hdp area to close.
  * @param  pointer on the vector table containing the reset handler the function
  *         jumps to.
  * @retval No return value.
  */
typedef void (*RSSLIB_S_CloseExitHDP_t)(uint32_t hdp_area, uint32_t jump_addr);

/**
  * @brief RSSLib function pointer structure
  */
typedef struct
{
  RSSLIB_S_CloseExitHDP_t CloseExitHDP;
}RSSLIB_pFunc_TypeDef;

